const SelfIntroduction = () => {
	return (
		<div className="flex justify-center">
			<div className="w-full max-w-3xl lg:max-w-4xl space-y-4 text-gray-700 leading-relaxed">
				<p>
					「コンピュータシステムの仕組みを理解したい」という知的好奇心に駆られて情報工学課程に入学しました．
					学部1回生でプログラミングを学び始め，何か実用的なものを作ってみたくて，2回生でAndroidアプリ開発に挑戦．
					もの創りによって課題を解決する楽しさに目覚め，身の回りの様々な課題を解決するために，
					ボットやWebアプリを開発してきました．
				</p>
				<p>
					学部3回生の時に，データ構造とアルゴリズムの知識を定着させることを主な目的として，
					競技プログラミングに入門しました．現在も水色コーダーを目指して毎週コンテストに参加し，
					高速な解法の考察を楽しんでいます．
				</p>
				<p>
					学部4回生から企業との共同研究に取り組んでおり，
					とある製品の生産計画を数理最適化という技術を用いて作成するプログラムを従業員の方と共同で開発しています．
					現在は試験的な運用を実施しており，フィードバックをもらいながら，生産効率を追求しています．
					安定的な運用体制を確立すべく，日々研究開発に励んでいます．
				</p>
			</div>
		</div>
	);
};

export default SelfIntroduction;
